# Taps
tap "axllent/apps"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "noahgorstein/tap"

# Binaries
brew "bash"
brew "bat"
brew "curl"
brew "diff-so-fancy"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "httpie"
brew "jq"
brew "mailpit"
brew "mas"
brew "neovim"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rsync"
brew "scc"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tldr"
brew "tmux"
brew "trash-cli"
brew "tree"
brew "yq"
brew "zoxide"
brew "noahgorstein/tap/jqp"

# Development
brew "php"
brew "mysql"
brew "node"

# Apps
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "brave-browser"
cask "cmd-eikana"
cask "deepl"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "font-biz-udgothic"
cask "font-jetbrains-mono-nerd-font"
cask "font-josefin-sans"
cask "font-lato"
cask "font-noto-sans-jp"
cask "font-plus-jakarta-sans"
cask "fork"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "keycastr"
cask "local"
cask "mamp"
cask "michaelvillar-timer"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-excel"
cask "monitorcontrol"
cask "ogdesign-eagle"
cask "polypane"
cask "postman"
cask "raycast"
cask "sequel-ace"
cask "slack"
cask "transmit"
cask "visual-studio-code"
cask "zeplin"
cask "zoom"

# Mac App Store
mas "Eagle for Safari", id: 1526651672
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "The Unarchiver", id: 425424353
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835

# VSCode extensions
vscode "alessandrosangalli.mob-vscode-gui"
vscode "antfu.smart-clicks"
vscode "arcsine.chronicler"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradgashler.htmltagwrap"
vscode "BriteSnow.vscode-toggle-quotes"
vscode "castello-dev.bash-snippets"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.path-intellisense"
vscode "cssho.vscode-svgviewer"
vscode "ctcuff.font-preview"
vscode "dbaeumer.vscode-eslint"
vscode "DEVSENSE.composer-php-vscode"
vscode "dsznajder.es7-react-js-snippets"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hakcorp.php-awesome-snippets"
vscode "junstyle.php-cs-fixer"
vscode "mdickin.markdown-shortcuts"
vscode "meganrogge.template-string-converter"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "meganrogge.template-string-converter"
vscode "MehediDracula.php-namespace-resolver"
vscode "mikestead.dotenv"
vscode "mkhl.shfmt"
vscode "mkxml.vscode-filesize"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "Natizyskunk.sftp"
vscode "natqe.reload"
vscode "pflannery.vscode-versionlens"
vscode "pnp.polacode"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "sburg.vscode-javascript-booster"
vscode "Shopify.theme-check-vscode"
vscode "sissel.shopify-liquid"
vscode "sleistner.vscode-fileutils"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "SomewhatStationery.some-sass"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "taichi.vscode-textlint"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "vunguyentuan.vscode-css-variables"
vscode "WallabyJs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "wordpresstoolbox.wordpress-toolbox"
vscode "xabikos.JavaScriptSnippets"
vscode "xdebug.php-debug"
vscode "yusukehirao.vscode-markuplint"
vscode "yzhang.markdown-all-in-one"
