{
        "$schema" : "https://aka.ms/winget-packages.schema.2.0.json",
        "CreationDate" : "2023-11-19T19:18:19.591-00:00",
        "Sources" :
        [
                {
                        "Packages" :
                        [
                                {
                                        "PackageIdentifier" : "AgileBits.1Password"
                                },
                                {
                                        "PackageIdentifier" : "xanderfrangos.twinkletray"
                                },
                                {
                                        "PackageIdentifier" : "Git.Git"
                                },
                                {
                                        "PackageIdentifier" : "Google.Chrome"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.Edge"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.EdgeWebView2Runtime"
                                },
                                {
                                        "PackageIdentifier" : "Mozilla.Firefox"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.OneDrive"
                                },
                                {
                                        "PackageIdentifier" : "RARLab.WinRAR"
                                },
                                {
                                        "PackageIdentifier" : "DeepL.DeepL"
                                },
                                {
                                        "PackageIdentifier" : "SlackTechnologies.Slack"
                                },
                                {
                                        "PackageIdentifier" : "ApacheFriends.Xampp.8.2"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.VCRedist.2013.x64"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.VCRedist.2013.x64"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.VCRedist.2015+.x64"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.VCRedist.2012.x86"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.VisualStudioCode"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.VCRedist.2015+.x86"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.PowerToys"
                                },
                                {
                                        "PackageIdentifier" : "Volta.Volta"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.VCRedist.2013.x86"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.PowerShell"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.VCRedist.2010.x64"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.VCRedist.2012.x64"
                                },
                                {
                                        "PackageIdentifier" : "Microsoft.DotNet.DesktopRuntime.6"
                                }
                        ],
                        "SourceDetails" :
                        {
                                "Argument" : "https://cdn.winget.microsoft.com/cache",
                                "Identifier" : "Microsoft.Winget.Source_8wekyb3d8bbwe",
                                "Name" : "winget",
                                "Type" : "Microsoft.PreIndexed.Package"
                        }
                }
        ],
        "WinGetVersion" : "1.6.3133"
}
